super_market/app/controllers/api/v1/customers_controller.rb

    def getCustomers
        @params = {}
        request.query_parameters.symbolize_keys.each do |param|
            if param[0] == :id
                @params[:id] = param[1]
            elsif param[0] == :name
                @params[:name] = param[1]
            elsif param[0] == :email_id
                @params[:email_id] = param[1]
            elsif param[0] == :phone_no
                @params[:phone_no] = param[1]
            elsif param[0] == :sex
                @params[:sex] = param[1]
            end
        end
        p @params
        if @params.length > 0
            @customers = Customer.where(@params)
        else
            @customers = Customer.all
---
SELECT "customers".* FROM "customers"

    def getPurchasesWithCustomerID
        @customer = Customer.find(params[:id]);
        @purchases = []
        @customer.purchases.to_ary.each do |purchase|
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ?  [["id", 6370045207]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 8249861028], ["LIMIT", 1]]

    def addCustomer
        Customer.create!(id: params[:id],name: params[:name],
            age: params[:age], email_id:params[:email_id], phone_no: params[:phone_no],
            sex: params[:sex], address: params[:address])
---
INSERT INTO "customers" ("id", "name", "age", "email_id", "phone_no", "sex", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def deleteCustomer
        @customer = Customer.find_by!(id: params[:id])
        @customer.destroy!
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 8249861028], ["LIMIT", 1]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 8249861028]]

    def editCustomer
        @customer = Customer.find_by!(id: params[:id])
        @update_data = {}
        params[:data].to_unsafe_h.symbolize_keys.each do |param|
            case param[0]
                when :id
                  @update_data[:id] = param[1]
                when :name
                  @update_data[:name] = param[1]
                when :age
                  @update_data[:age] = param[1]
                when :email_id
                  @update_data[:email_id] = param[1]
                when :phone_no
                  @update_data[:phone_no] = param[1]
                when :sex
                  @update_data[:sex] = param[1]
                when :address
                    @update_data[:address] = param[1]
                else
            end
        end
        if @update_data.length > 0
            @customer.update!(@update_data)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 8249861028], ["LIMIT", 1]]
UPDATE "customers" SET "age" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["age", 56], ["updated_at", "2022-08-16 09:15:55.285628"], ["id", 8249861028]]